zhiyb/STM32F722RE/src/usb_hw_ep.c
    // Not actually used
    if (len > max_len) {
        txrx_req[ch].data = (void *)data + max_len;
        txrx_req[ch].len = len - max_len;
        len = max_len;
    } else {
        txrx_req[ch].len = 0;
    }

    // Find next SW buffer
    uint32_t chep = CHEP(ch);
    bool sw_buf = !!(chep & USB_CHEP_DTOG_RX_Msk);
    volatile uint32_t *bd = sw_buf ? &usb_sram->chep[ch].RXTXBD : &usb_sram->chep[ch].TXRXBD;

    // Copy to USB SRAM buffer
    uint32_t *dst = TXRXDB_PTR(*bd);
    const uint32_t *src = data;
    for (uint32_t i = 0; i < (len + 3) / 4; i++)
        dst[i] = src[i];
    *bd = TXBD(len, dst);
    txrx_req[ch].db_valid[sw_buf] = 1;

    chep = CHEP(ch);
    if (txrx_req[ch].first ? sw_buf == 0 :
        !!(chep & USB_CHEP_DTOG_TX_Msk) == sw_buf) {
        // Endpoint is currently stalled, start transfer
        CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_VALID(chep) | USB_CHEP_DTOG_RX_Msk;
    }
}

void usb_hw_ep_tx_stall(uint8_t ep)
{
    uint8_t ch = ep_to_tx_ch(ep);
    uint32_t chep = CHEP(ch);
    CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_STALL(chep);
}

void usb_hw_ep_tx_nak(uint8_t ep)
{
    uint8_t ch = ep_to_tx_ch(ep);
    uint32_t chep = CHEP(ch);
    CHEP(ch) = CHEP_MASK(chep) | CHEP_TX_NAK(chep);
}

uint32_t *usb_hw_ep_tx_buffer(uint8_t ep, uint16_t *len)
{
    uint8_t ch = ep_to_tx_ch(ep);
    if (len)
        *len = ch_buf_size[ch][Tx];
    return TXRXDB_PTR(usb_sram->chep[ch].TXRXBD);
}

usb_endpoint_status_t usb_hw_ep_tx_status(uint8_t ep)
{
    uint32_t chep = CHEP(ep_to_tx_ch(ep));
    return (chep >> USB_CHEP_TX_STTX_Pos) & 0b11;
}

usb_endpoint_status_t usb_hw_ep_rx_status(uint8_t ep)
{
    uint32_t chep = CHEP(ep_to_rx_ch(ep));
    return (chep >> USB_CHEP_RX_STRX_Pos) & 0b11;
}


static volatile uint16_t usb_daddr = 0;

void usb_hw_set_address(uint16_t addr)
{
    usb_daddr = addr;
}

void usb_hw_ep_ctr_irq()
{
    for (uint8_t ch = 0; ch < 8; ch++) {
        uint32_t chep = CHEP(ch);
        uint8_t ep = chep & 0x0f;
        if (ch != 0 && ep == 0)
            break;

        if (chep & USB_CHEP_VTRX_Msk) {
            // RX complete, SETUP or OUT
            event_ev_t ev = EventOut;
            switch (chep & USB_CHEP_UTYPE_Msk) {
            case 0b01 << USB_CHEP_UTYPE_Pos:    // Control
                ev = EventSetup;
                if (chep & USB_CHEP_SETUP_Msk) {
                    // SETUP
                    uint32_t bd = usb_sram->chep[ch].RXTXBD;
                    uint32_t len = TXRXBD_COUNT(bd);
                    if (len != 8) {
                        // Invalid setup packet size, ignore
                        CHEP(ch) = (CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk) | CHEP_RX_VALID(chep);
                    } else {
                        // Data from USBRAM can only be accessed by word
                        // Copy to local buffer for easy access
                        uint32_t *dst = (uint32_t *)&ctrl_buf.setup;
                        uint32_t *src = TXRXDB_PTR(bd);
                        dst[0] = src[0];
                        dst[1] = src[1];

                        setup_t *setup = (setup_t *)&ctrl_buf.setup;
                        if (((setup->bmRequestType & 0x80) == 0) && (setup->wLength != 0)) {
                            // Continue receiving for DATA OUT
                            txrx_req[ch].data = (void volatile *)&ctrl_buf.data[0];
                            if (setup->wLength > sizeof(ctrl_buf.data)) {
                                DBG_BKPT("Insufficient buffer size");
                                txrx_req[ch].len = 0;
                            } else {
                                txrx_req[ch].len = setup->wLength;
                            }
                            CHEP(ch) = (CHEP_MASK(chep) & ~(USB_CHEP_KIND_Msk | USB_CHEP_VTRX_Msk)) | CHEP_RX_VALID(chep);

                        } else {
                            // SETUP complete, defer to main thread
                            event_push_irq(EventSetup, ch);
                            CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk;
                        }
                    }
                    break;

                } else if (TXRXBD_COUNT(usb_sram->chep[ch].RXTXBD) == 0) {
                    // 0-length data, STATUS OUT
                    // Wait for SETUP
                    CHEP(ch) = (CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk) | CHEP_RX_VALID(chep);
                    break;
                }

                // DATA OUT, fall-through

            case 0b11 << USB_CHEP_UTYPE_Pos: {  // Interrupt (or control)
                // DATA OUT
                uint32_t bd = usb_sram->chep[ch].RXTXBD;
                uint16_t len = TXRXBD_COUNT(bd);
                uint32_t buf_len = txrx_req[ch].len;
                len = len < buf_len ? len : buf_len;
                // Copy to data buffer
                uint32_t *dst = (uint32_t *)txrx_req[ch].data;
                uint32_t *src = TXRXDB_PTR(bd);
                for (uint16_t i = 0; i < (len + 3) / 4; i++)
                    dst[i] = src[i];
                buf_len -= len;
                txrx_req[ch].data = dst + len / 4;
                txrx_req[ch].len = buf_len;

                if (buf_len == 0) {
                    // DATA OUT complete, defer to main thread
                    event_push_irq(ev, ch);
                    // Keep NAK, wait for main thread
                    CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk;
                } else {
                    // More data to be received
                    CHEP(ch) = (CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk) | CHEP_RX_VALID(chep);
                }
                break;
            }

            case 0b00 << USB_CHEP_UTYPE_Pos:    // Bulk
                if (chep & USB_CHEP_KIND_Msk) {
                    // Double buffering support
                    if (txrx_req[ch].first) {
                        txrx_req[ch].first = false;
                        // The first Bulk OUT accepts 2 packets regardless of buffer state
                        txrx_req[ch].db_valid[1] = 1;
                        CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk;
                        // Check if we cleared VTRX for the 2nd RX
                        chep = CHEP(ch);
                        if ((chep & (USB_CHEP_VTRX_Msk | USB_CHEP_DTOG_RX_Msk)) == 0)
                            txrx_req[ch].db_valid[0] = 1;
                    } else {
                        bool sw_buf = !!(chep & USB_CHEP_DTOG_TX_Msk);
                        txrx_req[ch].db_valid[sw_buf] = 1;
                        if (!txrx_req[ch].db_valid[!sw_buf]) {
                            // Other buffer is available for OUT
                            CHEP(ch) = (CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk) | CHEP_RX_VALID(chep) | USB_CHEP_DTOG_TX_Msk;
                        } else {
                            CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTRX_Msk;
                        }
                    }
                }
                // Send OUT event to main thread
                event_push_irq(EventOut, ch);
                break;

            default:
                DBG_BKPT("Unhandled endpoint type");
            }

        } else if (chep & USB_CHEP_VTTX_Msk) {
            // DATA IN complete
            switch (chep & USB_CHEP_UTYPE_Msk) {
            case 0b01 << USB_CHEP_UTYPE_Pos:    // Control
                if (txrx_req[ch].len) {
                    // Continue with remaining data
                    usb_hw_ep_tx(ep, (void *)txrx_req[ch].data, txrx_req[ch].len, true);
                    CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTTX_Msk;
                } else {
                    // Wait for SETUP / STATUS OUT
                    CHEP(ch) = (CHEP_MASK(chep) & ~USB_CHEP_VTTX_Msk) | CHEP_RX_VALID(chep);
                    if (!(chep & USB_CHEP_KIND_Msk)) {
                        // STATUS IN, update device address
                        USB_DRD_FS->DADDR = USB_DADDR_EF_Msk | usb_daddr;
                    }
                }
                break;

            case 0b11 << USB_CHEP_UTYPE_Pos:    // Interrupt
                if (txrx_req[ch].len) {
                    // Continue with remaining data
                    usb_hw_ep_tx(ep, (void *)txrx_req[ch].data, txrx_req[ch].len, true);
                } else {
                    // No more data
                    event_push_irq(EventIn, ch);
                }
                CHEP(ch) = CHEP_MASK(chep) & ~USB_CHEP_VTTX_Msk;
                break;

